import streamlit as st
import pandas as pd
import os

st.set_page_config(page_title="Описание данных", layout="wide")

st.title("Информация о наборе данных")
st.write("### Предметная область: Цены на недвижимость в округе Кинг (King County)")

data_path = os.path.join('data', 'king_county_processed.csv')

if os.path.exists(data_path):
    df = pd.read_csv(data_path)
    st.write("#### Первые строки датасета:")
    st.dataframe(df.head())
    
    st.write("#### Размерность:")
    st.write(f"Строк: {df.shape[0]}, Признаков: {df.shape[1]}")

    st.markdown("""
    **Особенности предобработки данных и EDA:**
    1. Были удалены неинформативные признаки (например, `id`).
    2. Столбец `date` был преобразован, и из него выделены отдельные признаки: год продажи (`year_sale`) и месяц продажи (`month_sale`).
    3. Целевая переменная `price` была логарифмирована для десмещения распределения и борьбы с выбросами.
    4. Для некоторых моделей (ML6) признаки были отфильтрованы на основе матрицы корреляции и оставлены 12 наиболее значимых факторов.
    5. Удалены дубликаты и проверены пропущенные значения.
    """)

    st.markdown("""
    **Полный список признаков датасета King County:**
    
    * `price` — Цена продажи дома (Целевая переменная) — *в долларах США ($)*
    * `date` — Дата продажи объекта недвижимости
    * `bedrooms` — Количество спален
    * `bathrooms` — Количество ванных комнат 
    * `sqft_living` — Жилая площадь дома в кв. футах *(1 кв. фут ≈ 0.093 кв. м)*
    * `sqft_lot` — Площадь земельного участка в кв. футах
    * `floors` — Количество этажей в доме
    * `waterfront` — Вид на набережную
    * `view` — Оценка вида из окон (индекс от 0 до 4)
    * `condition` — Общее техническое состояние дома (индекс от 1 до 5)
    * `grade` — Оценка качества строительства и дизайна здания (индекс от 1 до 13)
    * `sqft_above` — Жилая площадь дома выше уровня земли (без учета подвала) в кв. футах
    * `sqft_basement` — Площадь подвального помещения в кв. футах
    * `yr_built` — Год первоначальной постройки дома
    * `yr_renovated` — Год последнего капитального ремонта (0, если ремонта не было)
    * `lat` — Географическая широта расположения объекта
    * `long` — Географическая долгота расположения объекта
    * `sqft_living15` — Средняя жилая площадь 15 ближайших соседних домов в кв. футах
    * `sqft_lot15` — Средняя площадь земельных участков 15 ближайших соседей в кв. футах
    """)
else:
    st.error("Файл 'data/king_county_processed.csv' не найден.")
    